<script setup>
import ScreenBox from "./components/ScreenBox.vue";
import ScreenTitle from "./components/ScreenTitle.vue";
import ScreenContent from "./components/ScreenContent.vue";
import { useStore } from "@/store/index.js";
const store = useStore();
setTimeout(() => {
  const cityData = {
    杭州市: {
      xList: [
        "上城区",
        "拱墅区",
        "西湖区",
        "滨江区",
        "萧山区",
        "余杭区",
        "富阳区",
        "临安区",
        "钱塘区",
        "临平区",
        "桐庐县",
        "淳安县",
        "建德市",
      ],
      yList: [
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
      ],
    },
    湖州市: {
      xList: ["吴兴区", "南浔区", "德清县", "长兴县", "安吉县"],
      yList: ["19999", "19999", "19999", "14999", "18999"],
    },
    嘉兴市: {
      xList: [
        "南湖区",
        "秀洲区",
        "嘉善县",
        "海盐县",
        "海宁市",
        "平湖市",
        "桐乡市",
      ],
      yList: ["16999", "17999", "18999", "13999", "16999", "10999", "18999"],
    },
    金华市: {
      xList: [
        "婺城区",
        "金东区",
        "武义县",
        "浦江县",
        "磐安县",
        "兰溪市",
        "义乌市",
        "东阳市",
        "永康市",
      ],
      yList: [
        "26999",
        "16999",
        "38999",
        "23999",
        "56999",
        "999",
        "19999",
        "9999",
        "19999",
      ],
    },
    丽水市: {
      xList: [
        "莲都区",
        "青田县",
        "缙云县",
        "遂昌县",
        "松阳县",
        "云和县",
        "庆元县",
        "景宁畲族自治县",
        "龙泉市",
      ],
      yList: [
        "26999",
        "16999",
        "38999",
        "23999",
        "56999",
        "29999",
        "19999",
        "38999",
        "56999",
      ],
    },
    宁波市: {
      xList: [
        "海曙区",
        "江北区",
        "北仑区",
        "镇海区",
        "鄞州区",
        "奉化区",
        "象山县",
        "宁海县",
        "余姚市",
        "慈溪市",
      ],
      yList: [
        "56999",
        "999",
        "19999",
        "38999",
        "56999",
        "26999",
        "16999",
        "38999",
        "23999",
        "38999",
        "56999",
      ],
    },
    衢州市: {
      xList: ["柯城区", "衢江区", "常山县", "开化县", "龙游县", "江山市"],
      yList: ["26999", "16999", "38999", "23999", "56999", "999", "19999"],
    },
    绍兴市: {
      xList: ["越城区", "柯桥区", "上虞区", "新昌县", "诸暨市", "嵊州市"],
      yList: ["19999", "19999", "19999", "14999", "18999", "14999"],
    },
    台州市: {
      xList: [
        "椒江区",
        "黄岩区",
        "路桥区",
        "三门县",
        "天台县",
        "仙居县",
        "温岭市",
        "临海市",
        "玉环市",
      ],
      yList: [
        "19999",
        "19999",
        "19999",
        "14999",
        "18999",
        "14999",
        "38999",
        "23999",
        "38999",
      ],
    },
    温州市: {
      xList: [
        "鹿城区",
        "龙湾区",
        "瓯海区",
        "洞头区",
        "永嘉县",
        "平阳县",
        "苍南县",
        "文成县",
        "泰顺县",
        "瑞安市",
        "乐清市",
        "龙港市",
      ],
      yList: [
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
        "29999",
      ],
    },
    舟山市: {
      xList: ["定海区", "普陀区", "岱山县", "嵊泗县"],
      yList: ["26999", "16999", "38999", "23999"],
    },
  };
  store.setCityData(cityData)
}, 500);
</script>

<template>
  <ScreenBox class="screen">
    <ScreenTitle></ScreenTitle>
    <ScreenContent></ScreenContent>
  </ScreenBox>
</template>

<style lang="less">
html,
body {
  margin: 0;
  padding: 0;
  width: 100%;
  height: 100%;
  background: #072b4a;
}
#app {
  position: absolute;
  height: 100%;
  width: 100%;
}
.box {
  box-sizing: border-box;
  display: flex;
  flex-direction: column;
  padding: 10px;
}
</style>
